Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveLoopChainIntersectedByExtensions Property
 Curve elements forming a chain which is intersected by extensions of the chain ends cannot be used as splitters and are ignored.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveLoopChainIntersectedByExtensions { get; }
Public Shared ReadOnly Property DividedSurfaceCurveLoopChainIntersectedByExtensions As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveLoopChainIntersectedByExtensions {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveLoopChainIntersectedByExtensions : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace